In [1]:
# import the necessary packages
import pandas as pd
import mysql.connector
print("packages imported")

#ignore warning message
import warnings
warnings.filterwarnings('ignore')

packages imported

In [19]:
# make a connection to mysql database for extracting the raw data
mydb = mysql.connector.connect(host='172.105.215.62', database='test123', user='db', password='20220306!')
df_orders = pd.read_sql('SELECT * FROM orders', con=mydb)

In [20]:
#查詢 1995-10-11 ~ 1996-07-01 出口國家的訂單筆數
df_orders=df_orders.set_index('OrderDate')
df_orders=df_orders.loc['1995-10-11':'1996-07-01']

In [24]:
df_orders.groupby(['ShipCountry'])['OrderID'].count()

ShipCountry
Argentina      12
Austria        20
Belgium        12
Brazil         43
Canada         11
Denmark         9
Finland         9
France         38
Germany        55
Ireland         8
Italy          16
Mexico         11
Norway          3
Poland          5
Portugal        3
Spain          13
Sweden         21
Switzerland    12
UK             28
USA            62
Venezuela      24
Name: OrderID, dtype: int64

In [25]:
#查詢所有銷售紀錄中，銷售業績最好的前三名業務
df_join_table = pd.read_sql('select * from (select c.firstname,sales_price from orders a join \
                                 (select orderid, unitprice*quantity as sales_price from `order details`) b on a.orderid=b.orderid join \
                                  employees c on a.employeeid=c.employeeid) d', con=mydb)

In [51]:
df_join_table.groupby('firstname')['sales_price'].sum().sort_values(ascending=False)

firstname
Margaret    250187.45
Janet       213051.30
Nancy       202143.71
Andrew      177749.26
Robert      141295.99
Laura       133301.03
Anne         82964.00
Michael      78198.10
Steven       75567.75
Name: sales_price, dtype: float64

In [52]:
#查詢 1996整年度訂單銷售當中，依照分類(CategoryName)計算銷售金額
df_1996 = pd.read_sql('select * from (select a.orderid, c.productid, b.unitprice*quantity as sales_price, categoryname from (\
                         select orderid from orders where year(orderdate)=1996 )a \
                         join `order details` b on a.orderid=b.orderid \
                         join products c on b.productid=c.productid \
                         join categories d on c.categoryid=d.categoryid)e', con=mydb)
df_1996

     orderid  productid  sales_price categoryname
0      10838          1         72.0    Beverages
1      10847          1       1440.0    Beverages
2      10863          1        360.0    Beverages
3      10869          1        720.0    Beverages
4      10905          1        360.0    Beverages
..       ...        ...          ...          ...
800    11000         77        390.0   Condiments
801    11015         77        234.0   Condiments
802    11060         77        130.0   Condiments
803    11068         77        364.0   Condiments
804    11077         77         26.0   Condiments

[805 rows x 4 columns]

In [53]:
df_1996.groupby('categoryname')['sales_price'].sum()

categoryname
Beverages         133899.00
Condiments         40810.05
Confections        67551.71
Dairy Products     93394.40
Grains/Cereals     36233.00
Meat/Poultry       74982.00
Produce            45463.00
Seafood            54914.44
Name: sales_price, dtype: float64